import IMoneyEntities from '../../../interfaces/IMoneyEntities';

/**
 * Описание названий денежных валют для арабского языка.
 * @public
 * @author Кудрявцев И.С.
 */
export default class French implements IMoneyEntities {
    currency = {
        рубль: ['روبل', 'روبل', 'روبل'],
        тенге: ['تنغي', 'تنغي', 'تنغي'],
        сум: ['سوم', 'سوم', 'سوم'],
        манат: ['مانات', 'مانات', 'مانات'],
    };

    shortCurrency = {
        руб: 'روبل',
        тнг: 'تنغي',
        сум: 'تنغي',
        ман: 'مانات',
    };

    superShortCurrency = {
        р: 'روبل',
        т: 'تنغي',
        с: 'تنغي',
        м: 'مانات',
    };

    subunit = {
        копейка: ['كوبيك', 'كوبيل', 'كوبيل'],
        тиын: ['كوبيك', 'كوبيك', 'كوبيك'],
        тийин: ['تيين', 'تيين', 'تيين'],
        тенге: ['تنغي', 'تنغي', 'تنغي'],
    };

    shortSubunit = {
        коп: 'كوبيك',
        тиын: 'كوبيك',
        тийин: 'تيين',
        тен: 'تنغي',
    };

    superShortSubunit = {
        к: 'كوبيك',
        тиын: 'كوبيك',
        т: 'تيين',
        тен: 'تنغي',
    };
}
