import IMoneyEntities from '../../../interfaces/IMoneyEntities';

/**
 * Описание названий денежных валют для иврита.
 * @public
 * @author Кудрявцев И.С.
 */
export default class French implements IMoneyEntities {
    currency = {
        рубль: ['רובל', 'רובל', 'רובל'],
        тенге: ['טנגה', 'טנגה', 'טנגה'],
        сум: ['סום', 'סום', 'סום'],
        манат: ['מנאט', 'מנאט', 'מנאט'],
    };

    shortCurrency = {
        руб: 'רובל',
        тнг: 'טנגה',
        сум: 'סום',
        ман: 'מנאט',
    };

    superShortCurrency = {
        р: 'רובל',
        т: 'טנגה',
        с: 'סום',
        м: 'מנאט',
    };

    subunit = {
        копейка: ['קופיקות', 'קופיקות', 'קופיקות'],
        тиын: ['פרוטה', 'פרוטה', 'פרוטה'],
        тийин: ['טיין', 'טיין', 'טיין'],
        тенге: ['טנגה', 'טנגה', 'טנגה'],
    };

    shortSubunit = {
        коп: 'קופיקות',
        тиын: 'פרוטה',
        тийин: 'טיין',
        тен: 'טנגה',
    };

    superShortSubunit = {
        к: 'קופיקות',
        тиын: 'פרוטה',
        т: 'טיין',
        тен: 'טנגה',
    };
}
