import IMoneyEntities from '../../../interfaces/IMoneyEntities';

/**
 * Описание названий денежных валют для русского языка.
 * @public
 * @author Кудрявцев И.С.
 */
export default class Russian implements IMoneyEntities {
    currency = {
        рубль: ['рубль', 'рубля', 'рублей', 'рубля'],
        тенге: ['тенге', 'тенге', 'тенге', 'тенге'],
        сум: ['cум', 'cум', 'cум', 'cум'],
        манат: ['манат', 'маната', 'манат', 'маната'],
    };

    shortCurrency = {
        руб: 'руб',
        тнг: 'тнг',
        сум: 'cум',
        ман: 'ман',
    };

    superShortCurrency = {
        р: 'р',
        т: 'т',
        с: 'с',
        м: 'м',
    };

    subunit = {
        копейка: ['копейка', 'копейки', 'копеек', 'копейки'],
        тиын: ['тиын', 'тиыни', 'тиыни', 'тиыня'],
        тийин: ['тийин', 'тийин', 'тийин', 'тийин'],
        тенге: ['тенге', 'тенге', 'тенге', 'тенге'],
    };

    shortSubunit = {
        коп: 'коп',
        тиын: 'тиын',
        тийин: 'тийин',
        тен: 'тен',
    };

    superShortSubunit = {
        к: 'к',
        тиын: 'тиын',
        т: 'т',
        тен: 'тен',
    };
}
